[
    {
        "recipient": "At first...",
        "message": "Hello po, I wanted to say that the thing I realized is that you, your presence, and your personality had a big impact on the server and made it engaging in the best way that made people interact, have fun, and create bonds. I remembered that you said that you're that friend who gets vented to a lot, and yet you yourself do not vent to people. I want to say that I'm pretty sure many people will lend an ear and time for you, and that includes me, so don't bottle up those emotions if it happens and gets difficult, and just vent it out. Not a lot of people can be like you, and that's something to be proud of.  Lastly, I appreciate and thank you for being you and for just being an honest person. Goodnight ><",
        "from": "01/24/2026"
    },
    {
        "recipient": "As I realize...",
        "message": "Hello po, your efforts are not small but impactful and it shows and it reflects in the server. Don't be hesitant on sharing your struggles because a listener also needs one so feel free to spill it out and I will lend a ear and the time. I'm also looking forward of getting along with you more along the way,  time will tell but nontheless I think it will be a fun one. Finally, thank you for being yourself and being that iya.",
        "from": "01/25/2026"
    },
    {
        "recipient": "As I type away...",
        "message": "Hello Ali. I'm writing this as I'm doing my computer laboratory activity. First thing, I've been reflecting and think on what happened today and that's because of you, so yeah, thank you, Ali. Second thing, I've also thought and felt the same thing as you, I wished that I've met you sooner and hoped that I've met you since the start and to be honest, I can only count the amount of people that I can view like that in my hand. Third and final thing, I've said this before and I'll say it again because it has never been more true for me as each day passes. Ali, you always recharge my energy in each and every end of the day, whether be I just got home from academics nor just a casual day for me and I think that trait of yours is a beautiful thing. I will now have to submit this activity and while I submit it, as the progress bar of the file transfer completes, thank you once again and I will never get tired of saying this. Thank you,  Ali, for being yourself to me.",
        "from": "02/03/2026"
    },
    {
        "recipient": "As I reflect...",
        "message": "Hello po, Ali. I'm writing this while currently in the school's library during my long vacant hours. I've noticed that your presence and energy has been helpful to me, it may be days where we casually talk or those days where one of us are down or may even be both of us. I wanted to say that your character is the best thing about you and for me genuinely, hopefully it does not change. As I am casually reading through a programming book I randomly picked from a sheld, Ali, as I said before and I'll never get tired of saying it. Thank you, for being your true self.",
        "from": "02/04/2026"
    }
]
