[
    {
        "title": "At first...",
        "message": "I wanted to say that the thing I realized is that you, your presence, and your personality had a big impact on the server and made it engaging in the best way that made people interact, have fun, and create bonds. I remembered that you said that you're that friend who gets vented to a lot, and yet you yourself do not vent to people. I want to say that I'm pretty sure many people will lend an ear and time for you, and that includes me, so don't bottle up those emotions if it happens and gets difficult, and just vent it out. Not a lot of people can be like you, and that's something to be proud of.  Lastly, I appreciate and thank you for being you and for just being an honest person. Goodnight ><",
        "date": "01/24/2026"
    },
    {
        "title": "As I realize...",
        "message": "That your efforts are not small but impactful and it shows and it reflects in the server. Don't be hesitant on sharing your struggles because a listener also needs one so feel free to spill it out and I will lend a ear and the time. I'm also looking forward of getting along with you more along the way,  time will tell but nontheless I think it will be a fun one. Finally, thank you for being yourself and being that iya.",
        "date": "01/25/2026"
    },
    {
        "title": "As I type away...",
        "message": "Ali, I'm writing this as I'm doing my computer laboratory activity. First thing, I've been reflecting and think on what happened today and that's because of you, so yeah, thank you, Ali. Second thing, I've also thought and felt the same thing as you, I wished that I've met you sooner and hoped that I've met you since the start and to be honest, I can only count the amount of people that I can view like that in my hand. Third and final thing, I've said this before and I'll say it again because it has never been more true for me as each day passes. Ali, you always recharge my energy in each and every end of the day, whether be I just got home date academics nor just a casual day for me and I think that trait of yours is a beautiful thing. I will now have to submit this activity and while I submit it, as the progress bar of the file transfer completes, thank you once again and I will never get tired of saying this. Thank you,  Ali, for being yourself to me.",
        "date": "02/03/2026"
    },
    {
        "title": "As I reflect...",
        "message": "Ali, I'm writing this while currently in the school's library during my long vacant hours. I've noticed that your presence and energy has been helpful to me, it may be days where we casually talk or those days where one of us are down or may even be both of us. I wanted to say that your character is the best thing about you and for me genuinely, hopefully it does not change. As I am casually reading through a programming book I randomly picked date a sheld, Ali, as I said before and I'll never get tired of saying it. Thank you, for being your true self.",
        "date": "02/04/2026"
    },
    {
        "title": "As I worry...",
        "message": "Ali, I'm writing this as I try to calm myself after the events earlier and prepare to go to sleep. I realized that talking to you in this moment keeps me sane. For the past few days, you've been my charger for my draining battery after each tiring day, po, and to be honest, I'm not complaining. You've become a part of my day, a chunk of my time, and a monopolizer of my attention. I've been worrying about you lately, especially those times when you take hours to reply. I know it's bad to overthink, but sometimes it happens. I know you tell me that you're okay regarding your health, but you also can't blame me for worrying because I care about you po, Ali. But at the end of the day, thank you, Ali, for being just you and being there po.",
        "date": "02/07/2026"
    },
    {
        "title": "As I assume...",
        "message": "Ali, I'm writing this as I'm making our computer laboratory activity for my underwhelming subject po. Lately, I've been thinking about something. Are you like this to others, or is it to me only? I know it's bad to assume this, but it's been popping up in my mind as of late. Sometimes you give, like, second-meaning hints, like the lyrics you sent today or those words that you said that you're worried that you've ruined my mood, but to be honest, it's cute that you reacted that way. Don't call me out, though, heh. Ali, I want you to know po that you've never ruined my mood, but instead, you lift it up. Every time I talk to you, I just get a vibe that I can be myself, who I am, what I want to convey, and such. Thank you so much po for being there for me when my mood goes down, chaotic, or not normal. Ali, thank you for being who you are when I talk to you.",
        "date": "02/08/2026"
    },
    {
        "title": "As I cling...",
        "message": "Ali, I'm writing this po before sleeping. I've noticed something about myself lately. I noticed that sometimes I look for you, your presence, and your existence, and I don't know why. To be honest, I never really understand what I feel sometimes, and this time is no different. Why am I like this when it comes to you? Why am I doing things for you when I can say no? Why am I writing this right now when I hate writing? Earlier, when you said you missed me, I realized, and something popped up in my mind, that I've been longing for you and been missing you when you're away because you're in the hospital. That feeling, I came to realize, and I understood something is up with me when it comes to you, Ali. But right now, I want to confirm if what I'm feeling is what I'm thinking, but nonetheless, Ali. I missed you, and thank you because I haven't felt like this in a long time.",
        "date": "02/10/2026"
    },
    {
        "title": "As I crave...",
        "message": "Ali, I've come to realize that my thoughts were correct; this day has been more proof and a justification for what those thoughts were. I am missing your presence a lot more, checking my Discord dms if you have messages that did not notify me or just staring at our chats randomly in my spare time where we don't talk. Honestly, I couldn't really pinpoint where it started, this feeling, this longing. I guess it just happened naturally, as if to catch me off guard, and you especially caught me off guard sometimes, and I don't know why, but nonetheless, I'm not complaining even though I should be. Ali, for now, my thoughts and what I feel are that I want to know more about you than I do at the moment, and hopefully in the future, I get to know and see it. Thank you for being that Ali and that person who looks at me for who I am.",
        "date": "02/13/2026"
    },
    {
        "title": "As I confess...",
        "message": "Dear Ms. Alliyannah Faith, I'm writing this as I process and have read what you said over ten times in a row now, and to be honest with you, I don't know where or what to start. To start things off, I'm happy that you felt that way, I'm happy that you see me that way, and I'm happy that you said that to me. To be honest, I walked around the area five times just to gather my thoughts on what you said. Am I dreaming? Is this real right now? Actually?! And after I went back, I was still trying to gather my thoughts, my mind, and my feelings and emotions. Ali, I'm genuinely grateful that I am a help to you. I don't know what you saw in me, honestly, but you can put me in my place if you ever disagree. Actually, when you said someone asked you out on a date, it bugged me, like it was very off-putting for me, but I tried to brush it off because I felt that I was not in the position to do so. I guess someone was getting a bit territorial, but I don't know if you felt it. Thank you so much, Ali. For being who you are and being honest with me as always, thank you for being you, and hopefully in the future we both keep doing our own things, but at the same time, keep each other special, worth it, and involved. As I conclude this, I will now share what I feel, what I know, and what I think. One thing that is true, Ali. The person that I like liked me too.",
        "date": "02/14/2026"
    }
]
